In [1]:
import pandas as pd

In [23]:
date_list = {"yyyy-mm-dd":["2005-09-28","2007-10-05","2012-12-20"]}
df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-20

## 첫번째 예제
### 하나의 컬럼값을 이용해 새로운 컬럼 생성하기
#### year 값을 만들어 적용

In [24]:
# 하나의 컬럼을 받아서 -로 분리한 뒤 첫번째 인자를 리턴하기

def extract_year(column):
    return column.split("-")[0]

In [25]:
# df['yyyy-mm-dd']컬럼에 apply() 함수 적용

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-20  2012

#### 적용할 함수와 다른 인자를 넘길 수 있는가?

In [26]:
# 현재연도에서 인자로 받은 연도를 빼서 나이 리턴

def get_age(year, current_year):
    return current_year - int(year)

In [28]:
df['age'] = df['year'].apply(get_age,current_year=2020)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   15
1  2007-10-05  2007   13
2  2012-12-20  2012    8

In [33]:
# introduce 작성

def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [35]:
# age 필드의 값을 가져와서 get_introduce 적용

df['introduce'] = df['age'].apply(get_introduce,                                  
                                  prefix="나는 ",
                                  suffix=" 입니다.")
df

   yyyy-mm-dd  year  age   introduce
0  2005-09-28  2005   15  나는 15 입니다.
1  2007-10-05  2007   13  나는 13 입니다.
2  2012-12-20  2012    8   나는 8 입니다.

#### 여러개의 컬럼을 가져와서 apply() 적용하기

In [37]:
def get_introduce_2(row):
    return "나는 " + str(row.year) + " 년에 태어났고, 나의 나이는 " + str(row.age) + " 입니다."

In [39]:
df['introduce2'] = df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age   introduce                       introduce2
0  2005-09-28  2005   15  나는 15 입니다.  나는 2005 년에 태어났고, 나의 나이는 15 입니다.
1  2007-10-05  2007   13  나는 13 입니다.  나는 2007 년에 태어났고, 나의 나이는 13 입니다.
2  2012-12-20  2012    8   나는 8 입니다.   나는 2012 년에 태어났고, 나의 나이는 8 입니다.

#### lambda 사용 가능

In [2]:
import seaborn as sns
import numpy as np

In [5]:
df = sns.load_dataset("iris")
df.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [6]:
df.apply(lambda x : x[0])

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
dtype: object

In [7]:
# 첫번째 글자만 가져오기

df['species'].apply(lambda x : x[0])

0      s
1      s
2      s
3      s
4      s
      ..
145    v
146    v
147    v
148    v
149    v
Name: species, Length: 150, dtype: object

In [12]:
df['species_3'] = df['species'].apply(lambda x : x[:3])
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

In [10]:
# 뒤에서 세번쨰까지 문자 가져오기

def smp(x):
    x = x[-3:]
    return x

In [13]:
df['species-3'] = df['species'].apply(smp)
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_3,species-3
0,5.1,3.5,1.4,0.2,setosa,set,osa
1,4.9,3.0,1.4,0.2,setosa,set,osa
2,4.7,3.2,1.3,0.2,setosa,set,osa
3,4.6,3.1,1.5,0.2,setosa,set,osa
4,5.0,3.6,1.4,0.2,setosa,set,osa
...,...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,vir,ica
146,6.3,2.5,5.0,1.9,virginica,vir,ica
147,6.5,3.0,5.2,2.0,virginica,vir,ica
148,6.2,3.4,5.4,2.3,virginica,vir,ica
149,5.9,3.0,5.1,1.8,virginica,vir,ica

## 두 번째 예제

In [2]:
df = pd.DataFrame({"영어": [60,70],"수학": [100, 50]}, index=["Dave","David"])
df

       영어   수학
Dave   60  100
David  70   50

In [4]:
# 함수 정의

def func(df_data):
    print(type(df_data))
    print(df_data.index)
    print(df_data.values)
    return df_data

In [6]:
# 열 기준(기본) 으로 함수 적용

df_func = df.apply(func,axis=0)  # axis=0 : 주지 않아도 됨
df_func

<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[60 70]
<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[100  50]

       영어   수학
Dave   60  100
David  70   50